###############################################################
#  Generated by:      Cadence Encounter 14.26-s039_1
#  OS:                Linux x86_64(Host ID srv02749)
#  Generated on:      Sun Apr 30 22:28:08 2023
#  Design:            computer
#  Command:           set_analysis_view -setup {func_max func_typ func_min} -hold {func_max func_typ func_min}
###############################################################
current_design computer
create_clock [get_ports {Clock}]  -name master_clock -period 3000.000000 -waveform {0.000000 1500.000000}
set_propagated_clock  [get_clocks {master_clock}]
set_clock_transition  -rise -min 0.5 [get_clocks {master_clock}]
set_clock_transition  -rise -max 0.5 [get_clocks {master_clock}]
set_clock_transition  -fall -min 0.5 [get_clocks {master_clock}]
set_clock_transition  -fall -max 0.5 [get_clocks {master_clock}]
set_propagated_clock  [get_ports {Clock}]
set_driving_cell -lib_cell BU1P -rise -min -pin PAD [get_ports {nMode}]
set_driving_cell -lib_cell BU1P -fall -min -pin PAD [get_ports {nMode}]
set_driving_cell -lib_cell BU24P -rise -max -pin PAD [get_ports {nMode}]
set_driving_cell -lib_cell BU24P -fall -max -pin PAD [get_ports {nMode}]
set_driving_cell -lib_cell BU1P -rise -min -pin PAD [get_ports {ScanEnable}]
set_driving_cell -lib_cell BU1P -fall -min -pin PAD [get_ports {ScanEnable}]
set_driving_cell -lib_cell BU24P -rise -max -pin PAD [get_ports {ScanEnable}]
set_driving_cell -lib_cell BU24P -fall -max -pin PAD [get_ports {ScanEnable}]
set_driving_cell -lib_cell BU1P -rise -min -pin PAD [get_ports {nReset}]
set_driving_cell -lib_cell BU1P -fall -min -pin PAD [get_ports {nReset}]
set_driving_cell -lib_cell BU24P -rise -max -pin PAD [get_ports {nReset}]
set_driving_cell -lib_cell BU24P -fall -max -pin PAD [get_ports {nReset}]
set_load -pin_load -max  1  [get_ports {nDigit[3]}]
set_load -pin_load -min  0.01  [get_ports {nDigit[3]}]
set_load -pin_load -max  1  [get_ports {nDigit[2]}]
set_load -pin_load -min  0.01  [get_ports {nDigit[2]}]
set_load -pin_load -max  1  [get_ports {nDigit[1]}]
set_load -pin_load -min  0.01  [get_ports {nDigit[1]}]
set_load -pin_load -max  1  [get_ports {nDigit[0]}]
set_load -pin_load -min  0.01  [get_ports {nDigit[0]}]
set_driving_cell -lib_cell BU1P -rise -min -pin PAD [get_ports {SDI}]
set_driving_cell -lib_cell BU1P -fall -min -pin PAD [get_ports {SDI}]
set_driving_cell -lib_cell BU24P -rise -max -pin PAD [get_ports {SDI}]
set_driving_cell -lib_cell BU24P -fall -max -pin PAD [get_ports {SDI}]
set_driving_cell -lib_cell BU1P -rise -min -pin PAD [get_ports {Test}]
set_driving_cell -lib_cell BU1P -fall -min -pin PAD [get_ports {Test}]
set_driving_cell -lib_cell BU24P -rise -max -pin PAD [get_ports {Test}]
set_driving_cell -lib_cell BU24P -fall -max -pin PAD [get_ports {Test}]
set_load -pin_load -max  1  [get_ports {SegF}]
set_load -pin_load -min  0.01  [get_ports {SegF}]
set_driving_cell -lib_cell BU1P -rise -min -pin PAD [get_ports {nCrank}]
set_driving_cell -lib_cell BU1P -fall -min -pin PAD [get_ports {nCrank}]
set_driving_cell -lib_cell BU24P -rise -max -pin PAD [get_ports {nCrank}]
set_driving_cell -lib_cell BU24P -fall -max -pin PAD [get_ports {nCrank}]
set_load -pin_load -max  1  [get_ports {DP}]
set_load -pin_load -min  0.01  [get_ports {DP}]
set_load -pin_load -max  1  [get_ports {SegC}]
set_load -pin_load -min  0.01  [get_ports {SegC}]
set_load -pin_load -max  1  [get_ports {SegE}]
set_load -pin_load -min  0.01  [get_ports {SegE}]
set_load -pin_load -max  1  [get_ports {SegD}]
set_load -pin_load -min  0.01  [get_ports {SegD}]
set_load -pin_load -max  1  [get_ports {SegA}]
set_load -pin_load -min  0.01  [get_ports {SegA}]
set_driving_cell -lib_cell BU1P -rise -min -pin PAD [get_ports {nTrip}]
set_driving_cell -lib_cell BU1P -fall -min -pin PAD [get_ports {nTrip}]
set_driving_cell -lib_cell BU24P -rise -max -pin PAD [get_ports {nTrip}]
set_driving_cell -lib_cell BU24P -fall -max -pin PAD [get_ports {nTrip}]
set_load -pin_load -max  1  [get_ports {SDO}]
set_load -pin_load -min  0.01  [get_ports {SDO}]
set_load -pin_load -max  1  [get_ports {SegB}]
set_load -pin_load -min  0.01  [get_ports {SegB}]
set_driving_cell -lib_cell BU1P -rise -min -pin PAD [get_ports {Clock}]
set_driving_cell -lib_cell BU1P -fall -min -pin PAD [get_ports {Clock}]
set_driving_cell -lib_cell BU24P -rise -max -pin PAD [get_ports {Clock}]
set_driving_cell -lib_cell BU24P -fall -max -pin PAD [get_ports {Clock}]
set_driving_cell -lib_cell BU1P -rise -min -pin PAD [get_ports {nFork}]
set_driving_cell -lib_cell BU1P -fall -min -pin PAD [get_ports {nFork}]
set_driving_cell -lib_cell BU24P -rise -max -pin PAD [get_ports {nFork}]
set_driving_cell -lib_cell BU24P -fall -max -pin PAD [get_ports {nFork}]
set_load -pin_load -max  1  [get_ports {SegG}]
set_load -pin_load -min  0.01  [get_ports {SegG}]
set_input_delay -add_delay 1 -min -network_latency_included -clock [get_clocks {master_clock}] [get_ports {nTrip}]
set_input_delay -add_delay 12 -max -network_latency_included -clock [get_clocks {master_clock}] [get_ports {nTrip}]
set_input_delay -add_delay 1 -min -network_latency_included -clock [get_clocks {master_clock}] [get_ports {Test}]
set_input_delay -add_delay 12 -max -network_latency_included -clock [get_clocks {master_clock}] [get_ports {Test}]
set_input_delay -add_delay 1 -min -network_latency_included -clock [get_clocks {master_clock}] [get_ports {nReset}]
set_input_delay -add_delay 12 -max -network_latency_included -clock [get_clocks {master_clock}] [get_ports {nReset}]
set_input_delay -add_delay 1 -min -network_latency_included -clock [get_clocks {master_clock}] [get_ports {SDI}]
set_input_delay -add_delay 12 -max -network_latency_included -clock [get_clocks {master_clock}] [get_ports {SDI}]
set_input_delay -add_delay 1 -min -network_latency_included -clock [get_clocks {master_clock}] [get_ports {nFork}]
set_input_delay -add_delay 12 -max -network_latency_included -clock [get_clocks {master_clock}] [get_ports {nFork}]
set_input_delay -add_delay 1 -min -network_latency_included -clock [get_clocks {master_clock}] [get_ports {ScanEnable}]
set_input_delay -add_delay 12 -max -network_latency_included -clock [get_clocks {master_clock}] [get_ports {ScanEnable}]
set_input_delay -add_delay 1 -min -network_latency_included -clock [get_clocks {master_clock}] [get_ports {nMode}]
set_input_delay -add_delay 12 -max -network_latency_included -clock [get_clocks {master_clock}] [get_ports {nMode}]
set_input_delay -add_delay 1 -min -network_latency_included -clock [get_clocks {master_clock}] [get_ports {nCrank}]
set_input_delay -add_delay 12 -max -network_latency_included -clock [get_clocks {master_clock}] [get_ports {nCrank}]
set_output_delay -add_delay 1 -min -network_latency_included -clock [get_clocks {master_clock}] [get_ports {SegG}]
set_output_delay -add_delay 8 -max -network_latency_included -clock [get_clocks {master_clock}] [get_ports {SegG}]
set_output_delay -add_delay 1 -min -network_latency_included -clock [get_clocks {master_clock}] [get_ports {SegA}]
set_output_delay -add_delay 8 -max -network_latency_included -clock [get_clocks {master_clock}] [get_ports {SegA}]
set_output_delay -add_delay 1 -min -network_latency_included -clock [get_clocks {master_clock}] [get_ports {SegB}]
set_output_delay -add_delay 8 -max -network_latency_included -clock [get_clocks {master_clock}] [get_ports {SegB}]
set_output_delay -add_delay 1 -min -network_latency_included -clock [get_clocks {master_clock}] [get_ports {SDO}]
set_output_delay -add_delay 8 -max -network_latency_included -clock [get_clocks {master_clock}] [get_ports {SDO}]
set_output_delay -add_delay 1 -min -network_latency_included -clock [get_clocks {master_clock}] [get_ports {SegC}]
set_output_delay -add_delay 8 -max -network_latency_included -clock [get_clocks {master_clock}] [get_ports {SegC}]
set_output_delay -add_delay 1 -min -network_latency_included -clock [get_clocks {master_clock}] [get_ports {nDigit[2]}]
set_output_delay -add_delay 8 -max -network_latency_included -clock [get_clocks {master_clock}] [get_ports {nDigit[2]}]
set_output_delay -add_delay 1 -min -network_latency_included -clock [get_clocks {master_clock}] [get_ports {DP}]
set_output_delay -add_delay 8 -max -network_latency_included -clock [get_clocks {master_clock}] [get_ports {DP}]
set_output_delay -add_delay 1 -min -network_latency_included -clock [get_clocks {master_clock}] [get_ports {nDigit[0]}]
set_output_delay -add_delay 8 -max -network_latency_included -clock [get_clocks {master_clock}] [get_ports {nDigit[0]}]
set_output_delay -add_delay 1 -min -network_latency_included -clock [get_clocks {master_clock}] [get_ports {SegD}]
set_output_delay -add_delay 8 -max -network_latency_included -clock [get_clocks {master_clock}] [get_ports {SegD}]
set_output_delay -add_delay 1 -min -network_latency_included -clock [get_clocks {master_clock}] [get_ports {SegE}]
set_output_delay -add_delay 8 -max -network_latency_included -clock [get_clocks {master_clock}] [get_ports {SegE}]
set_output_delay -add_delay 1 -min -network_latency_included -clock [get_clocks {master_clock}] [get_ports {SegF}]
set_output_delay -add_delay 8 -max -network_latency_included -clock [get_clocks {master_clock}] [get_ports {SegF}]
set_output_delay -add_delay 1 -min -network_latency_included -clock [get_clocks {master_clock}] [get_ports {nDigit[3]}]
set_output_delay -add_delay 8 -max -network_latency_included -clock [get_clocks {master_clock}] [get_ports {nDigit[3]}]
set_output_delay -add_delay 1 -min -network_latency_included -clock [get_clocks {master_clock}] [get_ports {nDigit[1]}]
set_output_delay -add_delay 8 -max -network_latency_included -clock [get_clocks {master_clock}] [get_ports {nDigit[1]}]
set_clock_uncertainty 0.1 -hold [get_clocks {master_clock}]
set_clock_uncertainty 0.5 -setup [get_clocks {master_clock}]
set_false_path  -from [get_ports {nReset}] 
